Revit 2024 API
ModelPath.Empty Property
 Whether this path is empty
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool Empty { get; }
Visual Basic
Public ReadOnly Property Empty As Boolean
	Get
Visual C++
public:
property bool Empty {
	bool get ();
}
See Also
ModelPath Class
Autodesk.Revit.DB Namespace